Tutorials/compressible/BackwardStepMine/Allrun.mpi
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar
runApplication mpirun -np 12 `getApplication` -parallel
runApplication reconstructPar
runApplication postProcess -func sampleDict

#------------------------------------------------------------------------------
